{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import os\n",
    "import neo4j\n",
    "from langchain_community.graphs import Neo4jGraph\n",
    "import pandas as pd\n",
    "\n",
    "from dotenv import load_dotenv\n",
    "\n",
    "load_dotenv(override=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " ###  neo4j initializing ### \n",
      "Connecting to Neo4j DBMS at neo4j://localhost:7687 as neo4j\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'Node properties:\\nMovie {id: INTEGER, released: DATE, title: STRING, tagline: STRING, imdbRating: FLOAT}\\nPerson {name: STRING}\\nGenre {name: STRING}\\nLocation {name: STRING}\\nSimilarMovie {name: STRING}\\nRelationship properties:\\n\\nThe relationships:\\n(:Movie)-[:IN_GENRE]->(:Genre)\\n(:Movie)-[:WAS_TAKEN_IN]->(:Location)\\n(:Movie)-[:IS_SIMILAR_TO]->(:SimilarMovie)\\n(:Person)-[:DIRECTED]->(:Movie)\\n(:Person)-[:ACTED_IN]->(:Movie)'"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#########################################################################\n",
    "#       Neo4j instance \n",
    "#########################################################################\n",
    "print(f' ###  neo4j initializing ### ')\n",
    "\n",
    "NEO4J_URI = os.getenv('NEO4J_URI')\n",
    "NEO4J_URL = NEO4J_URI\n",
    "NEO4J_USERNAME = os.getenv('NEO4J_USERNAME')\n",
    "NEO4J_PASSWORD = os.getenv('NEO4J_PASSWORD')\n",
    "NEO4J_DATABASE = os.getenv('NEO4J_DATABASE')\n",
    "\n",
    "embed_dim=384\n",
    "embedding_dimension=embed_dim\n",
    "\n",
    "print(f\"Connecting to Neo4j DBMS at {NEO4J_URL} as {NEO4J_USERNAME}\")\n",
    "graph = Neo4jGraph(url=NEO4J_URL, username=NEO4J_USERNAME, password=NEO4J_PASSWORD)\n",
    "\n",
    "graph.refresh_schema()\n",
    "\n",
    "graph.get_schema\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "## Existing graph schema...\n",
      "Node properties:\n",
      "Movie {id: INTEGER, released: DATE, title: STRING, tagline: STRING, imdbRating: FLOAT}\n",
      "Person {name: STRING}\n",
      "Genre {name: STRING}\n",
      "Location {name: STRING}\n",
      "SimilarMovie {name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Movie)-[:IN_GENRE]->(:Genre)\n",
      "(:Movie)-[:WAS_TAKEN_IN]->(:Location)\n",
      "(:Movie)-[:IS_SIMILAR_TO]->(:SimilarMovie)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n",
      "Deleting all nodes...\n",
      "Dropping all constraints...\n",
      "Dropping all indexes...\n",
      "Removing index movie_tagline_embeddings:\n",
      "\n",
      "## Blank schema...\n",
      "Node properties:\n",
      "\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "\n"
     ]
    }
   ],
   "source": [
    "#########################################################################\n",
    "#       Cleanup and start from scratch\n",
    "#########################################################################\n",
    "# Delete everything in a database\n",
    "cypher = \"\"\"\n",
    "MATCH (n) DETACH DELETE n\n",
    "\"\"\"\n",
    "graph.query(cypher)\n",
    "\n",
    "print(\"## Existing graph schema...\")\n",
    "print(graph.schema)\n",
    "\n",
    "print(\"Deleting all nodes...\")\n",
    "# Match all nodes in the graph\n",
    "cypher = \"\"\"\n",
    "  MATCH (n)\n",
    "  RETURN count (n)\n",
    "  \"\"\"\n",
    "result = graph.query(cypher)\n",
    "\n",
    "print(\"Dropping all constraints...\")\n",
    "for constraint in graph.query('SHOW CONSTRAINTS'):\n",
    "    graph.query(f\"DROP CONSTRAINT {constraint['name']}\")\n",
    "\n",
    "print(\"Dropping all indexes...\")\n",
    "for index in graph.query('SHOW INDEXES'):\n",
    "    print(f\"Removing index {index['name']}:\")\n",
    "    graph.query(f\"\"\"\n",
    "        DROP INDEX `{index['name']}`\n",
    "    \"\"\")\n",
    "\n",
    "print()\n",
    "print(\"## Blank schema...\")\n",
    "graph.refresh_schema()\n",
    "print(graph.schema)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "(20, 7)\n",
      "Index(['movieId', 'released', 'title', 'actors', 'director', 'genres',\n",
      "       'imdbRating'],\n",
      "      dtype='object')\n",
      " ########################33 stage3 \n"
     ]
    }
   ],
   "source": [
    "#########################################################################\n",
    "#   Import graph\n",
    "#########################################################################\n",
    "\n",
    "\n",
    "# Import a test movie database csv file only 20 rows for now \n",
    "df = pd.read_csv(\"https://raw.githubusercontent.com/tomasonjo/blog-datasets/main/movies/movies_small.csv\", nrows=20)\n",
    "print(df.shape)\n",
    "print(df.columns)\n",
    "\n",
    "\n",
    "# the movie database has only movie details.  Will add \n",
    "# Description \n",
    "# Location movies were made \n",
    "# Similar movies \n",
    "# Generate some taglines using chatgot:\n",
    "\n",
    "taglines = [\"The adventure life of toys takes off!\",\n",
    "\"Roll the dice and unleash the excitement!\",\n",
    "\"Still Yelling. Still Fighting. Still Ready for Love.\",\n",
    "\"Friends are the people who let you be yourself... and never let you forget it.\",\n",
    "\"Just When His World Is Back To Normal... He's In For The Surprise Of His Life!\",\n",
    "\"A Los Angeles crime saga\",\n",
    "\"You are cordially invited to the most surprising merger of the year.\",\n",
    "\"The Original Bad Boys.\",\n",
    "\"Terror goes into overtime.\",\n",
    "\"No limits. No fears. No substitutes.\",\n",
    "\"Why can't the most powerful man in the world have the one thing he wants most?\",\n",
    "\"Give blood...a whole new meaning.\",\n",
    "\"Part Dog. Part Wolf. All Hero.\",\n",
    "\"He had greatness within his grasp.\",\n",
    "\"The Course Has Been Set. There Is No Turning Back. Prepare Your Weapons. Summon Your Courage. Discover the Adventure of a Lifetime!\",\n",
    "\"No one stays at the top forever.\",\n",
    "\"Lose your heart and come to your senses.\",\n",
    "\"Twelve outrageous guests. Four scandalous requests. And one lone bellhop, in his first day on the job, who's in for the wildest New year's Eve of his life.\",\n",
    "\"New animals. New adventures. Same hair.\",\n",
    "\"Get on, or GET OUT THE WAY!\"]\n",
    "\n",
    "location = [\"United States\", \"United States\", \"United States\", \"United States\", \"United States\",\n",
    "           \"United States\", \"United States\", \"United States\", \"United States\", \"United Kingdom\",\n",
    "           \"United States\", \"United States\", \"United States\", \"United States\", \"Malta\",\n",
    "           \"United States\", \"United Kingdom\", \"United States\", \"United States\", \"United States\"]\n",
    "\n",
    "similar_movie = [\"Finding Nemo\", \"Jumanji: Welcome to the Jungle\", \"The Bucket List\", \"The Best Man Holiday\", \"Cheaper by the Dozen\",\n",
    "                 \"The Departed\", \"Notting Hill\", \"The Adventures of Huck Finn\", \"Die Hard\", \"Mission Impossible\",\n",
    "                 \"Dave\", \"Dead and Loving It: Young Frankenstein\", \"Spirit: Stallion of the Cimarron\", \"JFK\", \"Pirates of the Caribbean: The Curse of the Black Pearl\",\n",
    "                 \"Goodfellas\", \"Pride and Prejudice\", \"Pulp Fiction\", \"The Mask\", \"Speed\"\n",
    "                 ]\n",
    "\n",
    "# Add this to df\n",
    "df[\"similar_movie\"] = similar_movie\n",
    "df[\"tagline\"]       = taglines\n",
    "df[\"location\"]      = location\n",
    "# df.to_csv('/home/saraghava/moviebot/sample_data/movie.csv')\n",
    "print(f' ########################33 stage3 ')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'movieId': 1,\n",
       "  'released': '1995-11-22',\n",
       "  'title': 'Toy Story',\n",
       "  'actors': 'Jim Varney|Tim Allen|Tom Hanks|Don Rickles',\n",
       "  'director': 'John Lasseter',\n",
       "  'genres': 'Adventure|Animation|Children|Comedy|Fantasy',\n",
       "  'imdbRating': 8.3,\n",
       "  'similar_movie': 'Finding Nemo',\n",
       "  'tagline': 'The adventure life of toys takes off!',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 2,\n",
       "  'released': '1995-12-15',\n",
       "  'title': 'Jumanji',\n",
       "  'actors': 'Robin Williams|Bradley Pierce|Kirsten Dunst|Jonathan Hyde',\n",
       "  'director': 'Joe Johnston',\n",
       "  'genres': 'Adventure|Children|Fantasy',\n",
       "  'imdbRating': 6.9,\n",
       "  'similar_movie': 'Jumanji: Welcome to the Jungle',\n",
       "  'tagline': 'Roll the dice and unleash the excitement!',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 3,\n",
       "  'released': '1995-12-22',\n",
       "  'title': 'Grumpier Old Men',\n",
       "  'actors': 'Walter Matthau|Ann-Margret|Jack Lemmon|Sophia Loren',\n",
       "  'director': 'Howard Deutch',\n",
       "  'genres': 'Comedy|Romance',\n",
       "  'imdbRating': 6.6,\n",
       "  'similar_movie': 'The Bucket List',\n",
       "  'tagline': 'Still Yelling. Still Fighting. Still Ready for Love.',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 4,\n",
       "  'released': '1995-12-22',\n",
       "  'title': 'Waiting to Exhale',\n",
       "  'actors': 'Whitney Houston|Lela Rochon|Angela Bassett|Loretta Devine',\n",
       "  'director': 'Forest Whitaker',\n",
       "  'genres': 'Romance|Drama|Comedy',\n",
       "  'imdbRating': 5.6,\n",
       "  'similar_movie': 'The Best Man Holiday',\n",
       "  'tagline': 'Friends are the people who let you be yourself... and never let you forget it.',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 5,\n",
       "  'released': '1995-12-08',\n",
       "  'title': 'Father of the Bride Part II',\n",
       "  'actors': 'Steve Martin|Kimberly Williams-Paisley|Diane Keaton|Martin Short',\n",
       "  'director': 'Charles Shyer',\n",
       "  'genres': 'Comedy',\n",
       "  'imdbRating': 5.9,\n",
       "  'similar_movie': 'Cheaper by the Dozen',\n",
       "  'tagline': \"Just When His World Is Back To Normal... He's In For The Surprise Of His Life!\",\n",
       "  'location': 'United States'},\n",
       " {'movieId': 6,\n",
       "  'released': '1995-12-15',\n",
       "  'title': 'Heat',\n",
       "  'actors': 'Al Pacino|Robert De Niro|Val Kilmer|Jon Voight',\n",
       "  'director': 'Michael Mann',\n",
       "  'genres': 'Action|Crime|Thriller',\n",
       "  'imdbRating': 8.2,\n",
       "  'similar_movie': 'The Departed',\n",
       "  'tagline': 'A Los Angeles crime saga',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 7,\n",
       "  'released': '1995-12-15',\n",
       "  'title': 'Sabrina',\n",
       "  'actors': 'Julia Ormond|Harrison Ford|Nancy Marchand|Greg Kinnear',\n",
       "  'director': 'Sydney Pollack',\n",
       "  'genres': 'Comedy|Romance',\n",
       "  'imdbRating': 6.2,\n",
       "  'similar_movie': 'Notting Hill',\n",
       "  'tagline': 'You are cordially invited to the most surprising merger of the year.',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 8,\n",
       "  'released': '1995-12-22',\n",
       "  'title': 'Tom and Huck',\n",
       "  'actors': 'Jonathan Taylor Thomas|Brad Renfro|Eric Schweig|Charles Rocket',\n",
       "  'director': 'Peter Hewitt',\n",
       "  'genres': 'Children|Adventure',\n",
       "  'imdbRating': 5.6,\n",
       "  'similar_movie': 'The Adventures of Huck Finn',\n",
       "  'tagline': 'The Original Bad Boys.',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 9,\n",
       "  'released': '1995-12-22',\n",
       "  'title': 'Sudden Death',\n",
       "  'actors': 'Jean-Claude Van Damme|Powers Boothe|Raymond J. Barry|Whittni Wright',\n",
       "  'director': 'Peter Hyams',\n",
       "  'genres': 'Action',\n",
       "  'imdbRating': 5.7,\n",
       "  'similar_movie': 'Die Hard',\n",
       "  'tagline': 'Terror goes into overtime.',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 10,\n",
       "  'released': '1995-11-17',\n",
       "  'title': 'GoldenEye',\n",
       "  'actors': 'Pierce Brosnan|Famke Janssen|Sean Bean|Izabella Scorupco',\n",
       "  'director': 'Martin Campbell',\n",
       "  'genres': 'Adventure|Action|Thriller',\n",
       "  'imdbRating': 7.2,\n",
       "  'similar_movie': 'Mission Impossible',\n",
       "  'tagline': 'No limits. No fears. No substitutes.',\n",
       "  'location': 'United Kingdom'},\n",
       " {'movieId': 11,\n",
       "  'released': '1995-11-17',\n",
       "  'title': 'American President, The',\n",
       "  'actors': 'Martin Sheen|Michael J. Fox|Michael Douglas|Annette Bening',\n",
       "  'director': 'Rob Reiner',\n",
       "  'genres': 'Comedy|Romance|Drama',\n",
       "  'imdbRating': 6.8,\n",
       "  'similar_movie': 'Dave',\n",
       "  'tagline': \"Why can't the most powerful man in the world have the one thing he wants most?\",\n",
       "  'location': 'United States'},\n",
       " {'movieId': 12,\n",
       "  'released': '1995-12-22',\n",
       "  'title': 'Dracula: Dead and Loving It',\n",
       "  'actors': 'Peter MacNicol|Leslie Nielsen|Steven Weber|Amy Yasbeck',\n",
       "  'director': 'Mel Brooks',\n",
       "  'genres': 'Comedy|Horror',\n",
       "  'imdbRating': 5.8,\n",
       "  'similar_movie': 'Dead and Loving It: Young Frankenstein',\n",
       "  'tagline': 'Give blood...a whole new meaning.',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 13,\n",
       "  'released': '1995-12-22',\n",
       "  'title': 'Balto',\n",
       "  'actors': 'Kevin Bacon|Bob Hoskins|Jim Cummings|Bridget Fonda',\n",
       "  'director': 'Simon Wells',\n",
       "  'genres': 'Children|Adventure|Animation',\n",
       "  'imdbRating': 7.1,\n",
       "  'similar_movie': 'Spirit: Stallion of the Cimarron',\n",
       "  'tagline': 'Part Dog. Part Wolf. All Hero.',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 14,\n",
       "  'released': '1996-01-05',\n",
       "  'title': 'Nixon',\n",
       "  'actors': 'Ed Harris|Anthony Hopkins|Powers Boothe|Joan Allen',\n",
       "  'director': 'Oliver Stone',\n",
       "  'genres': 'Drama',\n",
       "  'imdbRating': 7.1,\n",
       "  'similar_movie': 'JFK',\n",
       "  'tagline': 'He had greatness within his grasp.',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 15,\n",
       "  'released': '1995-12-22',\n",
       "  'title': 'Cutthroat Island',\n",
       "  'actors': 'Geena Davis|Frank Langella|Matthew Modine|Maury Chaykin',\n",
       "  'director': 'Renny Harlin',\n",
       "  'genres': 'Romance|Adventure|Action',\n",
       "  'imdbRating': 5.6,\n",
       "  'similar_movie': 'Pirates of the Caribbean: The Curse of the Black Pearl',\n",
       "  'tagline': 'The Course Has Been Set. There Is No Turning Back. Prepare Your Weapons. Summon Your Courage. Discover the Adventure of a Lifetime!',\n",
       "  'location': 'Malta'},\n",
       " {'movieId': 16,\n",
       "  'released': '1995-11-22',\n",
       "  'title': 'Casino',\n",
       "  'actors': 'Robert De Niro|Joe Pesci|Sharon Stone|James Woods',\n",
       "  'director': 'Martin Scorsese',\n",
       "  'genres': 'Drama|Crime',\n",
       "  'imdbRating': 8.2,\n",
       "  'similar_movie': 'Goodfellas',\n",
       "  'tagline': 'No one stays at the top forever.',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 17,\n",
       "  'released': '1996-01-26',\n",
       "  'title': 'Sense and Sensibility',\n",
       "  'actors': 'James Fleet|Kate Winslet|Tom Wilkinson|Harriet Walter',\n",
       "  'director': 'Ang Lee',\n",
       "  'genres': 'Drama|Romance',\n",
       "  'imdbRating': 7.7,\n",
       "  'similar_movie': 'Pride and Prejudice',\n",
       "  'tagline': 'Lose your heart and come to your senses.',\n",
       "  'location': 'United Kingdom'},\n",
       " {'movieId': 18,\n",
       "  'released': '1995-12-25',\n",
       "  'title': 'Four Rooms',\n",
       "  'actors': 'Amanda De Cadenet|Valeria Golino|Madonna|Sammi Davis',\n",
       "  'director': 'Allison Anders|Robert Rodriguez|Quentin Tarantino| Alexandre Rockwell',\n",
       "  'genres': 'Comedy',\n",
       "  'imdbRating': 6.7,\n",
       "  'similar_movie': 'Pulp Fiction',\n",
       "  'tagline': \"Twelve outrageous guests. Four scandalous requests. And one lone bellhop, in his first day on the job, who's in for the wildest New year's Eve of his life.\",\n",
       "  'location': 'United States'},\n",
       " {'movieId': 19,\n",
       "  'released': '1995-11-10',\n",
       "  'title': 'Ace Ventura: When Nature Calls',\n",
       "  'actors': 'Jim Carrey|Ian McNeice|Simon Callow|Maynard Eziashi',\n",
       "  'director': 'Steve Oedekerk',\n",
       "  'genres': 'Comedy',\n",
       "  'imdbRating': 6.3,\n",
       "  'similar_movie': 'The Mask',\n",
       "  'tagline': 'New animals. New adventures. Same hair.',\n",
       "  'location': 'United States'},\n",
       " {'movieId': 20,\n",
       "  'released': '1995-11-22',\n",
       "  'title': 'Money Train',\n",
       "  'actors': 'Wesley Snipes|Robert Blake|Woody Harrelson|Jennifer Lopez',\n",
       "  'director': 'Joseph Ruben',\n",
       "  'genres': 'Crime|Comedy|Thriller|Drama|Action',\n",
       "  'imdbRating': 5.6,\n",
       "  'similar_movie': 'Speed',\n",
       "  'tagline': 'Get on, or GET OUT THE WAY!',\n",
       "  'location': 'United States'}]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "df.to_dict(orient='records')"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Use a query parameter\n",
    "\n",
    "Here we pass in the dataframe converted into a list of records as a query parameter named 'movies'.\n",
    "\n",
    "The Cypher `UNWIND` will turn break the array into a series of rows named `row`.\n",
    "We return the `row.actors` to illustrate."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'row.actors': 'Jim Varney|Tim Allen|Tom Hanks|Don Rickles'},\n",
       " {'row.actors': 'Robin Williams|Bradley Pierce|Kirsten Dunst|Jonathan Hyde'},\n",
       " {'row.actors': 'Walter Matthau|Ann-Margret|Jack Lemmon|Sophia Loren'},\n",
       " {'row.actors': 'Whitney Houston|Lela Rochon|Angela Bassett|Loretta Devine'},\n",
       " {'row.actors': 'Steve Martin|Kimberly Williams-Paisley|Diane Keaton|Martin Short'},\n",
       " {'row.actors': 'Al Pacino|Robert De Niro|Val Kilmer|Jon Voight'},\n",
       " {'row.actors': 'Julia Ormond|Harrison Ford|Nancy Marchand|Greg Kinnear'},\n",
       " {'row.actors': 'Jonathan Taylor Thomas|Brad Renfro|Eric Schweig|Charles Rocket'},\n",
       " {'row.actors': 'Jean-Claude Van Damme|Powers Boothe|Raymond J. Barry|Whittni Wright'},\n",
       " {'row.actors': 'Pierce Brosnan|Famke Janssen|Sean Bean|Izabella Scorupco'},\n",
       " {'row.actors': 'Martin Sheen|Michael J. Fox|Michael Douglas|Annette Bening'},\n",
       " {'row.actors': 'Peter MacNicol|Leslie Nielsen|Steven Weber|Amy Yasbeck'},\n",
       " {'row.actors': 'Kevin Bacon|Bob Hoskins|Jim Cummings|Bridget Fonda'},\n",
       " {'row.actors': 'Ed Harris|Anthony Hopkins|Powers Boothe|Joan Allen'},\n",
       " {'row.actors': 'Geena Davis|Frank Langella|Matthew Modine|Maury Chaykin'},\n",
       " {'row.actors': 'Robert De Niro|Joe Pesci|Sharon Stone|James Woods'},\n",
       " {'row.actors': 'James Fleet|Kate Winslet|Tom Wilkinson|Harriet Walter'},\n",
       " {'row.actors': 'Amanda De Cadenet|Valeria Golino|Madonna|Sammi Davis'},\n",
       " {'row.actors': 'Jim Carrey|Ian McNeice|Simon Callow|Maynard Eziashi'},\n",
       " {'row.actors': 'Wesley Snipes|Robert Blake|Woody Harrelson|Jennifer Lopez'}]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(f\"\"\"\n",
    "            UNWIND $movies AS row\n",
    "            RETURN row.actors\n",
    "            \"\"\", \n",
    "            params={'movies':df.to_dict(orient='records')})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " #############   ALL INSERTED TO NEO4J   ###########33 stage3 \n"
     ]
    }
   ],
   "source": [
    "######################################################################################################\n",
    "##the above pd frame needs to be copied into the correct path for neo4j to import\n",
    "##### ORiginal query local pointer did not work\n",
    "\n",
    "# graph.query(\"\"\"\n",
    "# LOAD CSV WITH HEADERS FROM  'file:///opt/neo4j/import/movie.csv'   // Load CSV data from a file specified by $movie_directory\n",
    "# AS row                                                      // Each row in the CSV will be represented as 'row'\n",
    "\n",
    "## ABK - instead, the dataframe is passed as a query parameter and directly loaded to Neo4j...\n",
    "graph.query(\"\"\"\n",
    "UNWIND $movies AS row                                       // Each row in the CSV will be represented as 'row'\n",
    "\n",
    "MERGE (m:Movie {id:row.movieId})                            // Merge a Movie node with the id from the row\n",
    "SET m.released = date(row.released),                        // Set the 'released' property of the Movie node to the date from the row\n",
    "    m.title = row.title,                                    // Set the 'title' property of the Movie node to the title from the row\n",
    "    m.tagline = row.tagline,                                // Set the 'tagline' property of the Movie node to the tagline from the row\n",
    "    m.imdbRating = toFloat(row.imdbRating)                  // Convert the 'imdbRating' from string to float and set it as the property\n",
    "\n",
    "FOREACH (director in split(row.director, '|') |             // For each director in the list of directors from the row (split by '|')\n",
    "    MERGE (p:Person {name:trim(director)})                  // Merge a Person node with the director's name from the row, trimming any extra spaces\n",
    "    MERGE (p)-[:DIRECTED]->(m))                             // Create a DIRECTED relationship from the director to the Movie\n",
    "\n",
    "FOREACH (actor in split(row.actors, '|') |                  // For each actor in the list of actors from the row (split by '|')\n",
    "    MERGE (p:Person {name:trim(actor)})                     // Merge a Person node with the actor's name from the row, trimming any extra spaces\n",
    "    MERGE (p)-[:ACTED_IN]->(m))                             // Create an ACTED_IN relationship from the actor to the Movie\n",
    "\n",
    "FOREACH (genre in split(row.genres, '|') |                  // For each genre in the list of genres from the row (split by '|')\n",
    "    MERGE (g:Genre {name:trim(genre)})                      // Merge a Genre node with the genre's name from the row, trimming any extra spaces\n",
    "    MERGE (m)-[:IN_GENRE]->(g))                             // Create an IN_GENRE relationship from the Movie to the Genre\n",
    "\n",
    "MERGE (l:Location {name:trim(row.location)})\n",
    "MERGE (m)-[:WAS_TAKEN_IN]->(l)\n",
    "\n",
    "MERGE (s:SimilarMovie {name:trim(row.similar_movie)})\n",
    "MERGE (m)-[:IS_SIMILAR_TO]->(s)\n",
    "\"\"\",\n",
    "# params={\"movie_directory\": str( movie_csv_path )}   )         # Pass the parameter movie_directory which contains the path to the CSV file\n",
    "params={\"movies\": df.to_dict(orient='records') }   )         # Pass the parameter movies which contains prepared dataframe\n",
    "print(f' #############   ALL INSERTED TO NEO4J   ###########33 stage3 ')\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      " creating embeddings for all taglines\n",
      "0                 The adventure life of toys takes off!\n",
      "1             Roll the dice and unleash the excitement!\n",
      "2     Still Yelling. Still Fighting. Still Ready for...\n",
      "3     Friends are the people who let you be yourself...\n",
      "4     Just When His World Is Back To Normal... He's ...\n",
      "5                              A Los Angeles crime saga\n",
      "6     You are cordially invited to the most surprisi...\n",
      "7                                The Original Bad Boys.\n",
      "8                            Terror goes into overtime.\n",
      "9                  No limits. No fears. No substitutes.\n",
      "10    Why can't the most powerful man in the world h...\n",
      "11                    Give blood...a whole new meaning.\n",
      "12                       Part Dog. Part Wolf. All Hero.\n",
      "13                   He had greatness within his grasp.\n",
      "14    The Course Has Been Set. There Is No Turning B...\n",
      "15                     No one stays at the top forever.\n",
      "16             Lose your heart and come to your senses.\n",
      "17    Twelve outrageous guests. Four scandalous requ...\n",
      "18              New animals. New adventures. Same hair.\n",
      "19                          Get on, or GET OUT THE WAY!\n",
      "Name: tagline, dtype: object\n",
      "Number of vectors: 20\n",
      "Embedding dimension: 384\n"
     ]
    }
   ],
   "source": [
    "#########################################################\n",
    "# Embeddings \n",
    "#########################################################\n",
    "from sentence_transformers import SentenceTransformer, util\n",
    "#model = SentenceTransformer('BAAI/bge-large-zh-v1.5')\n",
    "model = SentenceTransformer('all-MiniLM-L6-v2')\n",
    "from typing import List\n",
    "\n",
    "def embed_text(text:str)->List:\n",
    "    \"\"\"\n",
    "    Embeds the given text using the specified model.\n",
    "    Parameters:\n",
    "        text (str): The text to be embedded.\n",
    "    Returns:\n",
    "        List: A list containing the embedding of the text.\n",
    "    \"\"\"\n",
    "    response = model.encode(text)\n",
    "    return response\n",
    "\n",
    "######################################################################\n",
    "# For all taglines generate semantic meaning \n",
    "######################################################################\n",
    "print(f' creating embeddings for all taglines')\n",
    "print(f'{df[\"tagline\"]}')\n",
    "embedding_list = [embed_text(i)  for i in df[\"tagline\"]]\n",
    "df[\"taglineEmbedding\"] = embedding_list \n",
    "\n",
    "print(\"Number of vectors:\", len(embedding_list))\n",
    "print(\"Embedding dimension:\", len(embedding_list[0]))\n",
    "#print(f'{embedding_list[0][:5]}')\n",
    "#print(f'{embedding_list[19][:5]}')\n",
    "#print(f'{df.head(5)}')\n",
    "############################################\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "from langchain.vectorstores import Neo4jVector\n",
    "\n",
    "# Delete the existing vector index\n",
    "#Neo4jVector.delete_index(\"taglineEmbedding\")\n",
    "# Create a new vector index with the correct dimension\n",
    "#Neo4jVector.create_new_index(\"taglineEmbedding\", dimension=384)\n",
    "#vec_size = graph.retrieve_existing_index()\n",
    "#print(f'{vec_size}')\n",
    "########################################\n",
    "## Create vector index\n",
    "########################################\n",
    "graph.query(\"\"\"\n",
    "  CREATE VECTOR INDEX movie_tagline_embeddings IF NOT EXISTS      // Create a vector index named 'movie_tagline_embeddings' if it doesn't already exist  \n",
    "  FOR (m:Movie) ON (m.taglineEmbedding)                           // Index the 'taglineEmbedding' property of Movie nodes \n",
    "  OPTIONS { indexConfig: {                                        // Set options for the index\n",
    "    `vector.dimensions`: 384,                                    // Specify the dimensionality of the vector space (384 dimensions)\n",
    "    `vector.similarity_function`: 'cosine'                        // Specify the similarity function to be cosine similarity\n",
    "  }}\"\"\"\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'id': 1,\n",
       "  'name': 'movie_tagline_embeddings',\n",
       "  'state': 'ONLINE',\n",
       "  'populationPercent': 100.0,\n",
       "  'type': 'VECTOR',\n",
       "  'entityType': 'NODE',\n",
       "  'labelsOrTypes': ['Movie'],\n",
       "  'properties': ['taglineEmbedding'],\n",
       "  'indexProvider': 'vector-2.0',\n",
       "  'owningConstraint': None,\n",
       "  'lastRead': None,\n",
       "  'readCount': 0}]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "graph.query(\"\"\"\n",
    "  SHOW VECTOR INDEXES     // Retrieves information about all vector indexes in the database\n",
    "  \"\"\"\n",
    ")\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Node properties:\n",
      "Movie {id: INTEGER, released: DATE, title: STRING, tagline: STRING, imdbRating: FLOAT, taglineEmbedding: LIST}\n",
      "Person {name: STRING}\n",
      "Genre {name: STRING}\n",
      "Location {name: STRING}\n",
      "SimilarMovie {name: STRING}\n",
      "Relationship properties:\n",
      "\n",
      "The relationships:\n",
      "(:Movie)-[:IN_GENRE]->(:Genre)\n",
      "(:Movie)-[:WAS_TAKEN_IN]->(:Location)\n",
      "(:Movie)-[:IS_SIMILAR_TO]->(:SimilarMovie)\n",
      "(:Person)-[:DIRECTED]->(:Movie)\n",
      "(:Person)-[:ACTED_IN]->(:Movie)\n"
     ]
    }
   ],
   "source": [
    "#####################################################################\n",
    "#    Query and write to the neo4j database \n",
    "#####################################################################\n",
    "# for index, row in df.iterrows():\n",
    "#     movie_id = row['movieId']\n",
    "#     embedding = row['taglineEmbedding']\n",
    "#     graph.query(f\"MATCH (m:Movie {{id: '{movie_id}'}}) SET m.taglineEmbedding = '{embedding}'\")\n",
    "\n",
    "graph.query(\"\"\"\n",
    "UNWIND $movies AS row                                       // Each row in the CSV will be represented as 'row'\n",
    "\n",
    "MATCH (m:Movie {id:row.movieId})                            // MATCH a Movie node with the id from the row\n",
    "SET m.taglineEmbedding = row['taglineEmbedding']           // Set the 'taglineEmbedding' property of the Movie node to the taglineEmbedding from the row\n",
    "\"\"\",\n",
    "    params={\"movies\": df.to_dict(orient='records') }   )\n",
    "graph.refresh_schema()\n",
    "print(graph.schema)\n",
    "##########################################################################################\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'n.title': 'Toy Story',\n",
       "  'vectorDimenstions': 384,\n",
       "  'taglineEmbedding': [-0.014858802780508995,\n",
       "   0.05397352948784828,\n",
       "   0.08536024391651154,\n",
       "   0.027792304754257202,\n",
       "   0.00335156568326056,\n",
       "   0.037838175892829895,\n",
       "   0.05251464620232582,\n",
       "   -0.05486423149704933,\n",
       "   -0.016065603122115135,\n",
       "   0.06950561702251434,\n",
       "   0.0002916154626291245,\n",
       "   0.1087937131524086,\n",
       "   0.024859245866537094,\n",
       "   0.049804672598838806,\n",
       "   0.01531610544770956,\n",
       "   0.03190014138817787,\n",
       "   -0.039590977132320404,\n",
       "   0.01300706434994936,\n",
       "   0.043832141906023026,\n",
       "   0.014914039522409439,\n",
       "   0.02285548858344555,\n",
       "   -0.0337604321539402,\n",
       "   0.007378506939858198,\n",
       "   0.00672050379216671,\n",
       "   -0.06292126327753067,\n",
       "   0.09283105283975601,\n",
       "   -0.02255891263484955,\n",
       "   -0.007455799728631973,\n",
       "   -0.034123145043849945,\n",
       "   -0.028378935530781746,\n",
       "   0.04302135482430458,\n",
       "   0.06763318926095963,\n",
       "   -0.0017028233269229531,\n",
       "   -0.027964133769273758,\n",
       "   0.05187506228685379,\n",
       "   0.07441570609807968,\n",
       "   -0.012373019941151142,\n",
       "   -0.13546432554721832,\n",
       "   0.009557383134961128,\n",
       "   -0.02380622923374176,\n",
       "   -0.011281289160251617,\n",
       "   0.028552444651722908,\n",
       "   -0.0163633581250906,\n",
       "   -0.032869841903448105,\n",
       "   -0.015198368579149246,\n",
       "   -0.024204041808843613,\n",
       "   -0.06576989591121674,\n",
       "   -0.0783410519361496,\n",
       "   0.03335604444146156,\n",
       "   0.0481482669711113,\n",
       "   -0.010077076032757759,\n",
       "   -0.029653852805495262,\n",
       "   0.003890717402100563,\n",
       "   -0.044338516891002655,\n",
       "   0.036750998347997665,\n",
       "   0.02861045114696026,\n",
       "   0.03550189733505249,\n",
       "   -0.018391840159893036,\n",
       "   0.047187577933073044,\n",
       "   0.008433657698333263,\n",
       "   -0.07938998937606812,\n",
       "   0.06507731229066849,\n",
       "   0.05164645239710808,\n",
       "   0.030777443200349808,\n",
       "   0.015548056922852993,\n",
       "   -0.10144893825054169,\n",
       "   -0.017054688185453415,\n",
       "   0.023806186392903328,\n",
       "   -0.012446274980902672,\n",
       "   0.005153571721166372,\n",
       "   -0.04337972775101662,\n",
       "   0.031156186014413834,\n",
       "   0.0007176704239100218,\n",
       "   0.018119262531399727,\n",
       "   0.01771637238562107,\n",
       "   -0.009590990841388702,\n",
       "   -0.008141633123159409,\n",
       "   -0.06037989258766174,\n",
       "   0.02035992220044136,\n",
       "   0.003950124140828848,\n",
       "   -0.0211196206510067,\n",
       "   -0.1307852566242218,\n",
       "   -0.0019295956008136272,\n",
       "   -0.01587980054318905,\n",
       "   -0.06485334038734436,\n",
       "   -0.0023325178772211075,\n",
       "   0.0469728522002697,\n",
       "   -0.017303302884101868,\n",
       "   -0.0018607702804729342,\n",
       "   -0.010876860469579697,\n",
       "   -0.12302809208631516,\n",
       "   -0.04205174371600151,\n",
       "   0.025401994585990906,\n",
       "   0.0678887739777565,\n",
       "   -0.061736881732940674,\n",
       "   -0.026586536318063736,\n",
       "   -0.035345595329999924,\n",
       "   -0.02203085646033287,\n",
       "   -0.09363052248954773,\n",
       "   0.0253900233656168,\n",
       "   -0.05057904124259949,\n",
       "   0.0206557959318161,\n",
       "   0.08441311120986938,\n",
       "   -0.044284388422966,\n",
       "   -0.03364764526486397,\n",
       "   0.0034611495211720467,\n",
       "   -0.018641700968146324,\n",
       "   -0.03119638003408909,\n",
       "   0.0037785593885928392,\n",
       "   0.03434521704912186,\n",
       "   -0.03938501328229904,\n",
       "   -0.028683146461844444,\n",
       "   0.06867372989654541,\n",
       "   0.04090933874249458,\n",
       "   -0.033020518720149994,\n",
       "   -0.0031175401527434587,\n",
       "   -0.005909834057092667,\n",
       "   0.044744763523340225,\n",
       "   0.03059866651892662,\n",
       "   0.08040999621152878,\n",
       "   0.1621265411376953,\n",
       "   0.045581359416246414,\n",
       "   0.0739656388759613,\n",
       "   0.011262117885053158,\n",
       "   -0.017188597470521927,\n",
       "   -0.028191637247800827,\n",
       "   0.05229734629392624,\n",
       "   -3.542773567459336e-33,\n",
       "   -0.06490740180015564,\n",
       "   -0.08129353076219559,\n",
       "   0.03394079953432083,\n",
       "   0.08354640007019043,\n",
       "   0.03078436851501465,\n",
       "   0.013032172806560993,\n",
       "   0.007552077993750572,\n",
       "   0.026274561882019043,\n",
       "   -0.015562215819954872,\n",
       "   0.04140337556600571,\n",
       "   -0.00913034938275814,\n",
       "   0.028048228472471237,\n",
       "   -0.07950446009635925,\n",
       "   0.014029543846845627,\n",
       "   0.08000964671373367,\n",
       "   -0.030662572011351585,\n",
       "   -0.10097809880971909,\n",
       "   -0.060513801872730255,\n",
       "   0.07206545770168304,\n",
       "   0.0040768045000731945,\n",
       "   -0.025674117729067802,\n",
       "   0.020675452426075935,\n",
       "   0.004413686227053404,\n",
       "   0.10467851161956787,\n",
       "   0.009527078829705715,\n",
       "   0.056576237082481384,\n",
       "   0.033499881625175476,\n",
       "   -0.030929915606975555,\n",
       "   0.0031506891828030348,\n",
       "   0.02051236666738987,\n",
       "   -0.0007327116909436882,\n",
       "   0.0062354994006454945,\n",
       "   -0.06198678910732269,\n",
       "   -0.05327712744474411,\n",
       "   0.023290665820240974,\n",
       "   0.00044910379801876843,\n",
       "   -0.03716509789228439,\n",
       "   0.001953736413270235,\n",
       "   -0.05878991261124611,\n",
       "   0.02394270710647106,\n",
       "   -0.0019664366263896227,\n",
       "   -0.05746522545814514,\n",
       "   -0.05462229251861572,\n",
       "   0.04237372428178787,\n",
       "   -0.07811176776885986,\n",
       "   -0.004333991091698408,\n",
       "   0.12320072203874588,\n",
       "   -0.03413247689604759,\n",
       "   -0.0056792921386659145,\n",
       "   0.03834535926580429,\n",
       "   -0.06393720209598541,\n",
       "   -0.004859121050685644,\n",
       "   -0.0007818916928954422,\n",
       "   -0.062002528458833694,\n",
       "   -0.06842891126871109,\n",
       "   -0.042007386684417725,\n",
       "   0.019732508808374405,\n",
       "   -0.08824985474348068,\n",
       "   -0.00837104581296444,\n",
       "   -0.045598700642585754,\n",
       "   0.13524137437343597,\n",
       "   -0.011587772518396378,\n",
       "   0.07944879680871964,\n",
       "   -0.07686632871627808,\n",
       "   0.03622062876820564,\n",
       "   0.03568228706717491,\n",
       "   0.08001386374235153,\n",
       "   -0.011737032793462276,\n",
       "   0.004769755061715841,\n",
       "   0.03960287570953369,\n",
       "   -0.04511663317680359,\n",
       "   0.05645585060119629,\n",
       "   -0.0020507259760051966,\n",
       "   -0.08895154297351837,\n",
       "   0.0037563294172286987,\n",
       "   0.0013577744830399752,\n",
       "   -0.011377333663403988,\n",
       "   -0.04545973241329193,\n",
       "   -0.054775040596723557,\n",
       "   -0.031036708503961563,\n",
       "   0.03956758230924606,\n",
       "   0.01831755042076111,\n",
       "   -0.01662081480026245,\n",
       "   0.03561992198228836,\n",
       "   0.10769311338663101,\n",
       "   -0.10079338401556015,\n",
       "   0.0074984352104365826,\n",
       "   -0.13290353119373322,\n",
       "   0.008117892779409885,\n",
       "   0.0690532997250557,\n",
       "   -0.0023803573567420244,\n",
       "   -0.05373275652527809,\n",
       "   -0.0016399339074268937,\n",
       "   0.008699444122612476,\n",
       "   0.03351852670311928,\n",
       "   1.0718294325686893e-33,\n",
       "   -0.0042261709459125996,\n",
       "   -0.09255148470401764,\n",
       "   -0.029891574755311012,\n",
       "   -0.03530087321996689,\n",
       "   0.011379116214811802,\n",
       "   -0.05688108503818512,\n",
       "   -0.04161820188164711,\n",
       "   0.10652439296245575,\n",
       "   -0.009555359371006489,\n",
       "   0.031033050268888474,\n",
       "   -0.07632315903902054,\n",
       "   0.012304953299462795,\n",
       "   0.037990592420101166,\n",
       "   0.00010462104546604678,\n",
       "   0.027826376259326935,\n",
       "   -0.024478822946548462,\n",
       "   0.06860706210136414,\n",
       "   0.02506345883011818,\n",
       "   0.05502844601869583,\n",
       "   0.028246575966477394,\n",
       "   -0.01580151356756687,\n",
       "   0.0020915870554745197,\n",
       "   -0.09856738895177841,\n",
       "   -0.05556464567780495,\n",
       "   -0.04113999381661415,\n",
       "   0.09587667137384415,\n",
       "   0.0022385776974260807,\n",
       "   -0.054002828896045685,\n",
       "   -0.02918366529047489,\n",
       "   0.03377736359834671,\n",
       "   -0.025213534012436867,\n",
       "   -0.03699985519051552,\n",
       "   0.0029418019112199545,\n",
       "   0.04643035680055618,\n",
       "   -0.018489297479391098,\n",
       "   -0.0281172227114439,\n",
       "   -0.022220170125365257,\n",
       "   -0.022317925468087196,\n",
       "   -0.057561151683330536,\n",
       "   -0.10294351726770401,\n",
       "   0.03099159523844719,\n",
       "   -0.031236784532666206,\n",
       "   -0.042530227452516556,\n",
       "   0.09330129623413086,\n",
       "   0.008763294667005539,\n",
       "   0.01238221861422062,\n",
       "   0.0005057304515503347,\n",
       "   0.05334532633423805,\n",
       "   0.010096454061567783,\n",
       "   0.05746852234005928,\n",
       "   -0.06850036978721619,\n",
       "   0.017513442784547806,\n",
       "   0.012919431552290916,\n",
       "   -0.20178577303886414,\n",
       "   -0.030410485342144966,\n",
       "   -0.012989440932869911,\n",
       "   0.039852309972047806,\n",
       "   -0.0695006251335144,\n",
       "   0.057871654629707336,\n",
       "   0.04750578850507736,\n",
       "   0.020484071224927902,\n",
       "   0.043214429169893265,\n",
       "   -0.029980815947055817,\n",
       "   0.10483040660619736,\n",
       "   -0.027529576793313026,\n",
       "   -0.0247843898832798,\n",
       "   0.029897494241595268,\n",
       "   0.04831584170460701,\n",
       "   -0.01023854874074459,\n",
       "   -0.08663229644298553,\n",
       "   0.024573909118771553,\n",
       "   0.08581415563821793,\n",
       "   -0.03769055753946304,\n",
       "   -0.08771421760320663,\n",
       "   -0.04399745538830757,\n",
       "   0.05509592965245247,\n",
       "   0.02114565670490265,\n",
       "   -0.007314239628612995,\n",
       "   0.04688720777630806,\n",
       "   -0.05590935796499252,\n",
       "   0.016809090971946716,\n",
       "   0.01583303138613701,\n",
       "   0.016747567802667618,\n",
       "   0.006402499042451382,\n",
       "   -0.07102686911821365,\n",
       "   0.07471684366464615,\n",
       "   -0.10791832208633423,\n",
       "   0.020114105194807053,\n",
       "   -0.08175671845674515,\n",
       "   0.01592806726694107,\n",
       "   0.04226923733949661,\n",
       "   0.06271926313638687,\n",
       "   -0.005789785645902157,\n",
       "   0.06538008153438568,\n",
       "   -0.005696512758731842,\n",
       "   -1.836906804442151e-08,\n",
       "   -0.009381020441651344,\n",
       "   0.03909631818532944,\n",
       "   0.014458603225648403,\n",
       "   -0.0975400060415268,\n",
       "   0.06374707818031311,\n",
       "   0.015653925016522408,\n",
       "   -0.0318172313272953,\n",
       "   0.09492134302854538,\n",
       "   -0.0029899312648922205,\n",
       "   0.034082554280757904,\n",
       "   0.050388965755701065,\n",
       "   0.03305739909410477,\n",
       "   -0.001566385617479682,\n",
       "   0.09879082441329956,\n",
       "   0.03980748727917671,\n",
       "   0.0709415152668953,\n",
       "   0.001942573580890894,\n",
       "   0.048691701143980026,\n",
       "   -0.04186413437128067,\n",
       "   0.07789015769958496,\n",
       "   -0.032099928706884384,\n",
       "   0.0031618583016097546,\n",
       "   0.009171327576041222,\n",
       "   -0.025181496515870094,\n",
       "   -0.08522981405258179,\n",
       "   -0.023149432614445686,\n",
       "   -0.050950244069099426,\n",
       "   -0.040618374943733215,\n",
       "   0.09574297070503235,\n",
       "   0.053584661334753036,\n",
       "   0.08047812432050705,\n",
       "   0.02035706490278244,\n",
       "   -0.06354435533285141,\n",
       "   0.04353945329785347,\n",
       "   -0.05236117169260979,\n",
       "   -0.14413729310035706,\n",
       "   -0.03234662488102913,\n",
       "   0.0753139927983284,\n",
       "   0.004192292224615812,\n",
       "   -0.08014588057994843,\n",
       "   0.026781072840094566,\n",
       "   0.023286400362849236,\n",
       "   -0.00680822366848588,\n",
       "   0.025542641058564186,\n",
       "   -0.05739883333444595,\n",
       "   0.003035558620467782,\n",
       "   -0.021585240960121155,\n",
       "   -0.02431092970073223,\n",
       "   0.012430382892489433,\n",
       "   0.03467889130115509,\n",
       "   -0.08251844346523285,\n",
       "   -0.02076995186507702,\n",
       "   -0.07157323509454727,\n",
       "   0.012330876663327217,\n",
       "   0.10797689110040665,\n",
       "   0.0024354197084903717,\n",
       "   0.024270618334412575,\n",
       "   0.020102305337786674,\n",
       "   -0.09087049961090088,\n",
       "   0.036017559468746185,\n",
       "   0.035326793789863586,\n",
       "   -0.07742029428482056,\n",
       "   -0.008439144119620323,\n",
       "   0.06081162020564079]}]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "# Find one movie with a non-null taglineEmbedding, return the title, vector dimensions, and the embedding\n",
    "graph.query(\"\"\"\n",
    "  MATCH (n) WHERE (n.taglineEmbedding) IS NOT NULL \n",
    "  RETURN n.title, size(n.taglineEmbedding) as vectorDimenstions, n.taglineEmbedding AS taglineEmbedding LIMIT 1\n",
    "\"\"\"\n",
    ")\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "sharath-graphrag-n83OzrJt-py3.11",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.10"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
